Tutotial 13 - Roundoff Error in OpenFOAM/Case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  7
     \/     M anipulation  |
  \*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

activateCapillarity	1; //0.;

eps eps [0 0 0 0 0 0 0]	0.5;


phase.b
{
  rho	rho [1 -3 0 0 0 0 0] 	275e0; //1;
  mu	mu [1 -1 -1 0 0 0 0]	2.5e-5;//1.76e-5; //Pa.S
}

phase.a
{
  rho	rho [1 -3 0 0 0 0 0] 	1e3;
  mu	mu [1 -1 -1 0 0 0 0]	4.4e-4; //1e-3; //Pa.s
}

	


//// relative permeability model ////

relativePermeabilityModel   BrooksAndCorey;

//// capillarity pressure model ////

capillarityModel	BrooksAndCorey;

BrooksAndCoreyCoeffs
{
    // kr 
    n 4;

    // pc 
    pc0 5;
    alpha 0.2;
    	
    Sbmin 0.000001;
    Sbmax 0.999999;
}

sourceEventFileWater "injection.evt";

// ************************************************************************* //
